In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine
from config import my_password

In [2]:
train_df = pd.read_csv('aug_train.csv')

In [3]:
train_df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [4]:
train_df.drop(['city_development_index', 'last_new_job', 'training_hours'], axis = 'columns', inplace = True)
train_df.head()

,enrollee_id,city,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,target
0,8949,city_103,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1.0
1,29725,city_40,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,0.0
2,11561,city_21,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,0.0
3,33241,city_115,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,1.0
4,666,city_162,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,0.0

In [5]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          19158 non-null  int64
 1   city                 19158 non-null  object
 2   gender               14650 non-null  object
 3   relevent_experience  19158 non-null  object
 4   enrolled_university  18772 non-null  object
 5   education_level      18698 non-null  object
 6   major_discipline     16345 non-null  object
 7   experience           19093 non-null  object
 8   company_size         13220 non-null  object
 9   company_type         13018 non-null  object
 10  target               19158 non-null  float64
dtypes: float64(1), int64(1), object(9)
memory usage: 1.6+ MB

In [6]:
train_df.dropna(how='any', inplace=True)
train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8977 entries, 1 to 19155
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          8977 non-null   int64
 1   city                 8977 non-null   object
 2   gender               8977 non-null   object
 3   relevent_experience  8977 non-null   object
 4   enrolled_university  8977 non-null   object
 5   education_level      8977 non-null   object
 6   major_discipline     8977 non-null   object
 7   experience           8977 non-null   object
 8   company_size         8977 non-null   object
 9   company_type         8977 non-null   object
 10  target               8977 non-null   float64
dtypes: float64(1), int64(1), object(9)
memory usage: 841.6+ KB

In [7]:
train_df.to_csv('train_cleaned.csv', index=False)

In [8]:
male_filter = train_df['gender'] == 'Male'
train_male_df = train_df[male_filter]
train_male_df.head()

,enrollee_id,city,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,target
1,29725,city_40,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,0.0
4,666,city_162,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,0.0
7,402,city_46,Male,Has relevent experience,no_enrollment,Graduate,STEM,13,<10,Pvt Ltd,1.0
8,27107,city_103,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,50-99,Pvt Ltd,1.0
11,23853,city_103,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,5000-9999,Pvt Ltd,0.0

In [9]:
female_filter = train_df['gender'] == 'Female'
train_female_df = train_df[female_filter]
train_female_df.head()

,enrollee_id,city,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,target
33,26966,city_160,Female,Has relevent experience,no_enrollment,Graduate,STEM,>20,100-500,Pvt Ltd,0.0
40,2547,city_114,Female,Has relevent experience,Full time course,Masters,STEM,16,1000-4999,Public Sector,0.0
68,12730,city_16,Female,Has relevent experience,no_enrollment,Masters,Humanities,14,500-999,Public Sector,0.0
79,31449,city_103,Female,Has relevent experience,no_enrollment,Masters,STEM,2,<10,Early Stage Startup,0.0
86,30937,city_57,Female,No relevent experience,Part time course,Graduate,STEM,<1,10/49,Pvt Ltd,0.0

In [10]:
train_male_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8094 entries, 1 to 19155
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          8094 non-null   int64
 1   city                 8094 non-null   object
 2   gender               8094 non-null   object
 3   relevent_experience  8094 non-null   object
 4   enrolled_university  8094 non-null   object
 5   education_level      8094 non-null   object
 6   major_discipline     8094 non-null   object
 7   experience           8094 non-null   object
 8   company_size         8094 non-null   object
 9   company_type         8094 non-null   object
 10  target               8094 non-null   float64
dtypes: float64(1), int64(1), object(9)
memory usage: 758.8+ KB

In [11]:
train_female_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 805 entries, 33 to 19152
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          805 non-null    int64
 1   city                 805 non-null    object
 2   gender               805 non-null    object
 3   relevent_experience  805 non-null    object
 4   enrolled_university  805 non-null    object
 5   education_level      805 non-null    object
 6   major_discipline     805 non-null    object
 7   experience           805 non-null    object
 8   company_size         805 non-null    object
 9   company_type         805 non-null    object
 10  target               805 non-null    float64
dtypes: float64(1), int64(1), object(9)
memory usage: 75.5+ KB

In [12]:
male_sample_df = train_male_df.sample(n=805)
male_sample_df.head()

,enrollee_id,city,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,target
12746,1321,city_103,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,10000+,Pvt Ltd,0.0
15856,6792,city_57,Male,Has relevent experience,no_enrollment,Masters,STEM,12,50-99,Pvt Ltd,0.0
12131,32813,city_173,Male,No relevent experience,Full time course,Graduate,Humanities,2,1000-4999,Pvt Ltd,0.0
829,9147,city_16,Male,Has relevent experience,no_enrollment,Graduate,STEM,11,100-500,Pvt Ltd,0.0
7206,11930,city_102,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,0.0

In [13]:
merged_df = pd.concat([male_sample_df, train_female_df], axis=0)
merged_df.head()

,enrollee_id,city,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,target
12746,1321,city_103,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,10000+,Pvt Ltd,0.0
15856,6792,city_57,Male,Has relevent experience,no_enrollment,Masters,STEM,12,50-99,Pvt Ltd,0.0
12131,32813,city_173,Male,No relevent experience,Full time course,Graduate,Humanities,2,1000-4999,Pvt Ltd,0.0
829,9147,city_16,Male,Has relevent experience,no_enrollment,Graduate,STEM,11,100-500,Pvt Ltd,0.0
7206,11930,city_102,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,0.0

In [14]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1610 entries, 12746 to 19152
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          1610 non-null   int64
 1   city                 1610 non-null   object
 2   gender               1610 non-null   object
 3   relevent_experience  1610 non-null   object
 4   enrolled_university  1610 non-null   object
 5   education_level      1610 non-null   object
 6   major_discipline     1610 non-null   object
 7   experience           1610 non-null   object
 8   company_size         1610 non-null   object
 9   company_type         1610 non-null   object
 10  target               1610 non-null   float64
dtypes: float64(1), int64(1), object(9)
memory usage: 150.9+ KB

In [15]:
merged_df.to_csv('train_balanced.csv', index=False)

## Connect to Postgres Database

In [16]:
rds_connection_string = "postgres:password@localhost:5432/job_change"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [17]:
engine.table_names()

['alembic_version', 'response', 'train_balanced', 'test_balanced']

## Export DataFrame to SQL

In [18]:
merged_df.to_sql(name='train_balanced', con=engine, if_exists='replace', index=False)